#define _CRT_SECURE_NO_WARNINGS
#include<stdio.h>
int main(void) {
	/*
	* 로또번호 맞추기 게임
	*
	* - 사용된 구문
	* 1. for문과 Math.
	*/
	int input[6]; // 사용자 번호를 담기위한 정수형 배열
	int random[10]; // 로또번호를 만들기 위한 정수형 배열
	int cnt = 0;
	int duplicateInput = 0;
	//printf("동일한 숫자는 입력 할 수 없습니다.");
	printf("로또번호 6자리를 입력 하세요: ");

	for (int i = 0; i < 6; i++)
	{
		scanf("%d", &input[i]);
		printf("%d", input[i]);

		if (input[i - 1] > 99) {
			printf("----------------------------------------------------------------------------------------------\n");
			printf("\n");
			printf("\n세번째 자리는 입력 할 수 없습니다.\n");
			printf("----------------------------------------------------------------------------------------------\n");
			printf("\n");
			return 0;
		}
		else if (i > 0) {
			duplicateInput = input[i];
			for (int j = 0; j < i; j++) {
				if (duplicateInput == input[j]) {
					printf("\n----------------------------------------------------------------------------------------------\n");
					printf("\n");
					printf("\n동일한 숫자는 입력 할 수 없습니다.\n");
					printf("----------------------------------------------------------------------------------------------\n");
					printf("\n");
					return 0;
				}
			}
		}
	}

	for (int i = 1; i < 8; i++) {
		random[i - 1] = rand() % 46; // 난수 생성
		//printf("%d ", random[i - 1]);
	}

	for (int i = 0; i < 7; i++) {
		for (int j = 0; j < 6; j++) {
			if (random[i] == input[j]) {
				cnt++;
			}
		}
	}

	printf("\n----------------------------------------------------------------------------------------------\n");
	printf("\n");
	printf("로또번호: ");
	for (int i = 0; i < 7; i++) {
		printf("%d ", random[i]);
	}

	printf("\n");
	printf("입력번호: ");
	for (int i = 0; i < 6; i++) {
		printf("%d ", input[i]);
	}

	printf("\n\n----------------------------------------------------------------------------------------------\n");
	printf("\n");

	printf("----------------------------------------------------------------------------------------------\n");
	printf("\n");

	if (cnt <= 3) {
		printf("4등 입니다.\n");
	}
	else if (cnt == 4) {
		printf("3등 입니다.\n");
	}
	else if (cnt == 5) {
		printf("2등 입니다.\n");
	}
	else if (cnt == 6) {
		printf("1등 입니다.\n");
	}
	printf("\n");
	printf("----------------------------------------------------------------------------------------------\n");

	return 0;

}